Update README.md
Improve README visual design
